from string import ascii_letters

heiroglyphs = [chr(i) for i in range(0x13000, 0x13000 + len(ascii_letters))]
substition = {glyph : letter for letter, glyph in zip(ascii_letters, heiroglyphs)}

text = """
𓀞𓀆𓀘𓀏𓀓𓀈𓀀𓀍 𓀇𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀒 𓀖𓀄𓀑𓀄 𓀓𓀇𓀄 𓀅𓀎𓀑𓀌𓀀𓀋 𓀖𓀑𓀈𓀓𓀈𓀍𓀆 𓀒𓀘𓀒𓀓𓀄𓀌 𓀔𓀒𓀄𓀃 𓀈𓀍 𓀚𓀍𓀂𓀈𓀄𓀍𓀓 𓀞𓀆𓀘𓀏𓀓 𓀅𓀎𓀑 𓀖𓀑𓀈𓀓𓀈𓀍𓀆 𓀓𓀇𓀄 𓀞𓀆𓀘𓀏𓀓𓀈
𓀀𓀍 𓀋𓀀𓀍𓀆𓀔𓀀𓀆𓀄. 𓀡𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀒 𓀂𓀎𓀌𓀁𓀈𓀍𓀄𓀃 𓀈𓀃𓀄𓀎𓀆𓀑𓀀𓀏𓀇𓀈𓀂, 𓀋𓀎𓀆𓀎𓀆𓀑𓀀𓀏𓀇𓀈𓀂, 𓀒𓀘𓀋𓀋𓀀𓀁𓀈𓀂 𓀀𓀍𓀃 𓀀𓀋𓀏𓀇𓀀𓀁𓀄𓀓𓀈𓀂 𓀄𓀋𓀄𓀌𓀄𓀍𓀓𓀒, 𓀖𓀈
𓀓𓀇 𓀌𓀎𓀑𓀄 𓀓𓀇𓀀𓀍 100 𓀃𓀈𓀒𓀓𓀈𓀍𓀂𓀓 𓀂𓀇𓀀𓀑𓀀𓀂𓀓𓀄𓀑𓀒. 𓀜𓀔𓀑𓀒𓀈𓀕𓀄 𓀇𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀒 𓀖𓀄𓀑𓀄 𓀔𓀒𓀄𓀃 𓀅𓀎𓀑 𓀑𓀄𓀋𓀈𓀆𓀈𓀎𓀔𓀒 𓀋𓀈𓀓𓀄𓀑𓀀𓀓𓀔𓀑𓀄 𓀎𓀍 𓀏𓀀
𓀏𓀘𓀑𓀔𓀒 𓀀𓀍𓀃 𓀖𓀎𓀎𓀃. 𓀭𓀇𓀄 𓀋𓀀𓀓𓀄𓀑 𓀇𓀈𓀄𓀑𓀀𓀓𓀈𓀂 𓀀𓀍𓀃 𓀃𓀄𓀌𓀎𓀓𓀈𓀂 𓀞𓀆𓀘𓀏𓀓𓀈𓀀𓀍 𓀒𓀂𓀑𓀈𓀏𓀓𓀒 𓀖𓀄𓀑𓀄 𓀃𓀄𓀑𓀈𓀕𓀄𓀃 𓀅𓀑𓀎𓀌 𓀇𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀈𓀂 𓀖�
𓀈𓀓𓀈𓀍𓀆,, 𓀀𓀒 𓀖𓀀𓀒 𓀓𓀇𓀄 𓀩𓀑𓀎𓀓𓀎-𓀬𓀈𓀍𓀀𓀈𓀓𓀈𓀂 𓀒𓀂𓀑𓀈𓀏𓀓 𓀓𓀇𓀀𓀓 𓀋𓀀𓀓𓀄𓀑 𓀄𓀕𓀎𓀋𓀕𓀄𓀃 𓀈𓀍𓀓𓀎 𓀓𓀇𓀄 𓀩𓀇𓀎𓀄𓀍𓀈𓀂𓀈𓀀𓀍 𓀀𓀋𓀏𓀇𓀀𓀁𓀄𓀓. 𓀞𓀆𓀘𓀏𓀓𓀈𓀀�
  𓀇𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀒 𓀀𓀑𓀄 𓀓𓀇𓀄 𓀔𓀋𓀓𓀈𓀌𓀀𓀓𓀄 𓀀𓀍𓀂𓀄𓀒𓀓𓀎𓀑 𓀎𓀅 𓀓𓀇𓀄 𓀩𓀇𓀎𓀄𓀍𓀈𓀂𓀈𓀀𓀍 𓀀𓀋𓀏𓀇𓀀𓀁𓀄𓀓, 𓀓𓀇𓀄 𓀅𓀈𓀑𓀒𓀓 𓀖𓀈𓀃𓀄𓀋𓀘 𓀀𓀃𓀎𓀏𓀓𓀄𓀃 𓀏𓀇𓀎𓀍
𓀄𓀓𓀈𓀂 𓀖𓀑𓀈𓀓𓀈𓀍𓀆 𓀒𓀘𓀒𓀓𓀄𓀌. 𓀦𓀎𓀑𓀄𓀎𓀕𓀄𓀑, 𓀎𓀖𓀈𓀍𓀆 𓀈𓀍 𓀋𓀀𓀑𓀆𓀄 𓀏𓀀𓀑𓀓 𓀓𓀎 𓀓𓀇𓀄 𓀠𓀑𓀄𓀄𓀊 𓀀𓀍𓀃 𓀚𓀑𓀀𓀌𓀀𓀈𓀂 𓀒𓀂𓀑𓀈𓀏𓀓𓀒 𓀓𓀇𓀀𓀓 𓀃𓀄𓀒𓀂𓀄𓀍𓀃𓀄�
  𓀅𓀑𓀎𓀌 𓀩𓀇𓀎𓀄𓀍𓀈𓀂𓀈𓀀𓀍, 𓀓𓀇𓀄 𓀌𓀀𓀉𓀎𓀑𓀈𓀓𓀘 𓀎𓀅 𓀓𓀇𓀄 𓀖𓀎𓀑𓀋𓀃'𓀒 𓀋𓀈𓀕𓀈𓀍𓀆 𓀖𓀑𓀈𓀓𓀈𓀍𓀆 𓀒𓀘𓀒𓀓𓀄𓀌𓀒 𓀀𓀑𓀄 𓀃𓀄𓀒𓀂𓀄𓀍𓀃𓀀𓀍𓀓𓀒 𓀎𓀅 𓀞𓀆𓀘𓀏𓀓𓀈𓀀𓀍
𓀇𓀈𓀄𓀑𓀎𓀆𓀋𓀘𓀏𓀇𓀒—𓀌𓀎𓀒𓀓 𓀏𓀑𓀎𓀌𓀈𓀍𓀄𓀍𓀓𓀋𓀘 𓀓𓀇𓀄 𓀥𓀀𓀓𓀈𓀍 𓀀𓀍𓀃 𓀜𓀘𓀑𓀈𓀋𓀋𓀈𓀂 𓀒𓀂𓀑𓀈𓀏𓀓𓀒 𓀓𓀇𓀑𓀎𓀔𓀆𓀇 𓀠𓀑𓀄𓀄𓀊, 𓀀𓀍𓀃 𓀓𓀇𓀄 𓀚𓀑𓀀𓀁𓀈𓀂 𓀀𓀍𓀃 𓀛𓀑�
𓀇𓀌𓀈𓀂  𓀒𓀂𓀑𓀈𓀏𓀓𓀒 𓀓𓀇𓀑𓀎𓀔𓀆𓀇 𓀚𓀑𓀀𓀌𓀀𓀈𓀂. 𓀩𓀋𓀀𓀘𓀆𓀑𓀎𓀔𓀍𓀃𓀒𓀜𓀭𓀟{𓀊𓀀𓀈𓀎𓀊𓀄𓀍_𓀒𓀀𓀈𓀃_𓀀𓀍𓀂𓀈𓀄𓀍𓀓_𓀄𓀆𓀘𓀏𓀓}
"""


pt = ""
for letter in text:
    if letter in substition:
        pt += substition[letter]
    else:
        pt += letter
    
print(pt)