from السر import العلم
from المساعدون import *

def التشفير(النص, المفتاح):
    return التشفير_المتقدم_الموحد(المفتاح, كتاب_الرموز_الإلكترونية).encrypt(النص)

def بالليل(النص):
    المفتاح = "تعبانننن".encode('utf-8')
    return التشفير(النص, المفتاح)

def بالصبح(النص):
    المفتاح = "زهقانننن".encode('utf-8')
    return التشفير(النص, المفتاح)

def قوم(النص):
    العملية = عشوائي([بالليل, بالصبح])
    return العملية(النص)


العلم = تهشيم(العلم, 16)
الشيفرة = قوم(قوم(قوم(قوم(قوم(قوم(قوم(قوم(قوم(قوم(قوم(قوم(العلم))))))))))))
اطبع(الشيفرة)


